app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `phone_number`, `age`, `date_of_birth`, `gender`) VALUES ('titus', 'titus@gmail.com', '2021-09-05 02:00:29.775430', '2021-09-05 02:00:29.775430', '0961547617', 21, '2000-05-24', 'Nu')

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `users`.`updated_at` = '2021-09-04 16:46:07.041307', `users`.`phone_number` = '0961462385', `users`.`age` = 21 WHERE `users`.`id` = 1